pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU32.PIC
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLFSET" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:addr="0xA07">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="PERBV" edc:nzwidth="0x1" edc:desc="Period Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CMP0BV" edc:nzwidth="0x1" edc:desc="Compare 0 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CMP1BV" edc:nzwidth="0x1" edc:desc="Compare 1 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CMP2BV" edc:nzwidth="0x1" edc:desc="Compare 2 Buffer Valid"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0xA09">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="CNTAEI" edc:nzwidth="0x1" edc:desc="Count on Event Input A"/>
            <edc:SFRFieldDef edc:cname="EVACTA" edc:nzwidth="0x3" edc:desc="Event Action A">
              <edc:SFRFieldSemantic edc:cname="CNT_POSEDGE" edc:desc="Count on positive edge event" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CNT_ANYEDGE" edc:desc="Count on any edge event" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CNT_HIGHLVL" edc:desc="Count on prescaled clock while event line is 1." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x7) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CNTBEI" edc:nzwidth="0x1" edc:desc="Count on Event Input B"/>
            <edc:SFRFieldDef edc:cname="EVACTB" edc:nzwidth="0x3" edc:desc="Event Action B">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_POSEDGE" edc:desc="Restart counter at positive edge event" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_ANYEDGE" edc:desc="Restart counter on any edge event" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_HIGHLVL" edc:desc="Restart counter while event line is 1." edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="-nnn---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x71" edc:addr="0xA0A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:nzwidth="0x1" edc:desc="Compare 2 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="-nnn---n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x71" edc:addr="0xA0B">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:nzwidth="0x1" edc:desc="Compare 2 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:addr="0xA0E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="TEMP" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:addr="0xA0F"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CNT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA20"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="PER" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA26"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP0" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA28"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2A"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP2" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2C"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="PERBUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA36"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP0BUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA38"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP1BUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3A"/>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CMP2BUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3C"/>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TCA0/SPLIT">
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0xA00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Module Enable"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x3" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_PER" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_PER / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_PER / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_PER / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_PER / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_PER / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_PER / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-nnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x77" edc:addr="0xA01">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0EN" edc:nzwidth="0x1" edc:desc="Low Compare 0 Enable"/>
            <edc:SFRFieldDef edc:cname="LCMP1EN" edc:nzwidth="0x1" edc:desc="Low Compare 1 Enable"/>
            <edc:SFRFieldDef edc:cname="LCMP2EN" edc:nzwidth="0x1" edc:desc="Low Compare 2 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0EN" edc:nzwidth="0x1" edc:desc="High Compare 0 Enable"/>
            <edc:SFRFieldDef edc:cname="HCMP1EN" edc:nzwidth="0x1" edc:desc="High Compare 1 Enable"/>
            <edc:SFRFieldDef edc:cname="HCMP2EN" edc:nzwidth="0x1" edc:desc="High Compare 2 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLC" edc:nzwidth="0x8" edc:access="-nnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x77" edc:addr="0xA02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0OV" edc:nzwidth="0x1" edc:desc="Low Compare 0 Output Value"/>
            <edc:SFRFieldDef edc:cname="LCMP1OV" edc:nzwidth="0x1" edc:desc="Low Compare 1 Output Value"/>
            <edc:SFRFieldDef edc:cname="LCMP2OV" edc:nzwidth="0x1" edc:desc="Low Compare 2 Output Value"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0OV" edc:nzwidth="0x1" edc:desc="High Compare 0 Output Value"/>
            <edc:SFRFieldDef edc:cname="HCMP1OV" edc:nzwidth="0x1" edc:desc="High Compare 1 Output Value"/>
            <edc:SFRFieldDef edc:cname="HCMP2OV" edc:nzwidth="0x1" edc:desc="High Compare 2 Output Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
